using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Drawing;
using AstroPhysics.Properties;

namespace AstroPhysics.Astronomy
{
    partial class PlanetInfo
    {
        public static PlanetInfo Sun
        {
            get
            {
                return new PlanetInfo(
                    Resources.Sun1,
                    Resources.Sun_,
                    "Слънце",
"Звездата в центъра на Слънчевата система. То представлява почти идеална сфера, съставена от гореща плазма и магнитни полета.Слънцето е звезда от I популация, богата на тежки елементи (различни от водород и хелий). Образуването му изглежда е предизвикано от ударни вълни от една или повече близки свръхнови.За това говори голямото количество тежки елементи, като злато и уран, в Слънчевата система в сравнение със системите от II популация."
,
 @"Характеристика:
 Диаметър - 1 392 000 km
 Маса - 2 x 10 000 000 Ykg
Температура
 1)ядро - 13,6 MK
 2)повърхност - 5780 K
 3)корона - 5 MK 
Светимост (LS) 3,827x1 000 YW
 Фотосферно съдържание:
 Водород  73,46 %
 Хелий     24,85 %
 Кислород 0,77 %
 Въглерод 0,29 %
 Желязо    0,16 %
 Неон       0,12 %
 

"
                    );
            }
        }
        public static PlanetInfo Mercury
        {
            get
            {
                return new PlanetInfo(
                    Resources.Mercury1,
                    Resources.Mercury_,
                    "Меркурий",
@"Най-близката до Слънцето и най-малката планета в Слънчевата система. Видимата величина на планетата варира между 0,4 и 5,5; Меркурий се наблюдава винаги в непосредствена близост до Слънцето и поради това рядко бива наблюдаван с телескопи. Физическите характеристики на планетата са подобни на тези на Луната. По повърхността на Меркурий има множество кратери, и също няма никакви естествени спътници и почти никаква атмосфера. Има голямо планетно ядро от желязо, което създава магнитно поле.
",
 @" Характеристика:
Орбитален период -  87,96 дни
Диаметър - 4879,4 km
Маса - 3,302x1 000 Zkg
Повърхностна температура
1)мин. - 90 K
2)средна - 440 K
3)макс. - 700 K
"
                    );
            }
        }
        public static PlanetInfo Venus
        {
            get
            {
                return new PlanetInfo(
                    Resources.Venus1,
                    Resources.Venus_,
                    "Венера",
@"Втората по ред планета от Слънчевата система и носи името на богинята Венера от римската митология. Тя е земеподобна планета, много близка по големина и общи качества до Земята; понякога е наричана „планетата-сестра на Земята“. От всички планети в Слънчевата система Венера има най-малък орбитален ексцентрицитет равен на 0,7% (нейната орбита е почти идеално кръгла).
",
 @" Характеристика :

Орбитален период - 224,70096 дни 
Диаметър - 4,60x1 Gkm
Маса - 4,8685x10 Ykg
Повърхностна температура
1)мин. - 228 K
2)средна - 737 K
3)макс. - 773 K

"
                    );
            }
        }
        public static PlanetInfo Earth
        {
            get
            {
                return new PlanetInfo(
                    Resources.Earth1,
                    Resources.Earth_,
                    "Земя",
@"Tретата планета в Слънчевата система. Тя е най-голямата от земеподобните планети в тази система и единствената, на коятоспоред съвременните научни схващания има живот. Земята е формирана преди около 4,54 милиардa години и скоро след това придобива единствения си естествен спътник — Луната. От всички животински видове, които са се развили на Земята, човекът (Homo sapiens) е единственият, който е развил интелигентност.).
",
 @" Характеристика :

Орбитален период - 365,4 дни
Диаметър - 12 713,500 km
Маса - 5,9736x10 Ykg
Повърхностна температура
1)мин. - 185 K
2)средна - 287 К
3)макс. - 331 K
 Луни : Една на брой - Луна.


"
                    );
            }
        }
        public static PlanetInfo Moon
        {
            get
            {
                return new PlanetInfo(
                    Resources.Moon1,
                    Resources.Earth_,
                    "Луна",
@"Луната е единственият естествен спътник на Земята и петият по размери в Слънчевата система. Традиционните български названия месец и месечина днес се използват единствено поетично. Нейният символ е полумесец.През 1969, Нийл Армстронг и Едуин Олдрин стават първите хора, стъпили на Луната.
",
 @" Характеристика :
Орбитален период -  27 дни 7 часа 43,2 мин.
Диаметър - 3476,2 km
Маса - 7,347673×0,1 Zkg
Повърхностна температура -
- мин. - 40 K
- средна - 250 K
- макс. - 396 K



"
                    );
            }
        }
        public static PlanetInfo Mars
        {
            get
            {
                return new PlanetInfo(
                    Resources.Mars1,
                    Resources.Mars_,
                    "Марс",
@"Четвъртата планета от Слънчевата система. Тя носи името на бога на войната от римската митология Марс поради факта, че изглежда червена на нощното небе. По тази причина е наричана още „Червената планета“. Марс има два естествени спътника: Фобос и Деймос, които са малки по размери, с неправилна форма и за които се счита, че са прихванати от гравитацията на планетата астероиди. Символът на планетата е стилизирано изображение на щита и копието на Марс.
",
 @" Характеристика :

Орбитален период - 686,96 дни
Диаметър - 6804,9 km
Маса - 6,4185x1 Ykg
Повърхностна температура
1) мин. - 133 K
2)средна - 210 K
3)макс.  - 293 K
Луни - Фобос , Деймос 




"
                    );
            }
        }
        public static PlanetInfo Phobos
        {
            get
            {
                return new PlanetInfo(
                    Resources.Phobos1,
                    Resources.Mars_,
                    "Фобос",
@"По-големият и на по-близка орбита спътник на Марс. Той носи името на бога на страха от древногръцката митология Фобос, син на бог Арес и брат на бог Деймос. Фобос е на най-ниска орбита от всички други спътници в Слънчевата система — на 6000 km над повърхността на Марс. Спътникът е и един от най-малките известни.",
@"Характеристика :
Орбитален период - 0,3189 дни (7 часа 39,2 мин)
Диаметър - 44,4 km
Маса - 1,07 × 100 Pkg
Повърхностна температура ~ 233 K



"
                    );
            }
        }
        public static PlanetInfo Deimos
        {
            get
            {
                return new PlanetInfo(
                    Resources.Deimos1,
                    Resources.Mars_,
                    "Деймос",
@"Деймос е по-малкия и по-отдалечен от спътниците на Марс. Носи името на бога на ужаса от древногръцката митология Деймос, син на бога на войната Арес.За Деймос се смята че е астероид който под въздействието на Юпитер се е отклонил към вътрешната част на Слънчевата система и е бил заловен от гравитационното поле на Марс. Неговата форма е неправилна — размерите му са приблизително 15×12×10 km.
",
 @" Характерстика : 
Орбитален период - 1,262 дни
Диаметър - 25,2 km 
Маса - 2,244×10 Pkg
Повърхностна температура ~ 233 K





"
                    );
            }
        }
        public static PlanetInfo Jupiter
        {
            get
            {
                return new PlanetInfo(
                    Resources.Jupiter1,
                    Resources.Jupiter_,
                    "Юпитер",
@"Петата по отдалеченост от Слънцето планета и най-голямата (с голяма преднина) в Слънчевата система. Юпитер и другите газови гиганти в Слънчевата система (Сатурн, Уран и Нептун) са известни още като юпитероподобни планети, планети-гиганти.Юпитер е известен на човечеството още от древни времена, и присъства във вярванията и митологиите на много култури. Планетата е именувана от римляните и носи името на бог Юпитер от тяхната митология. В гръцката митология това е главният бог, гръмовержецът Зевс.
",
 @" Характеристика :
Орбитален период - 4335,3545 дни
Диаметър - 142 984 km 
Маса -  1,899×10 000 Ykg
Повърхностна температура
1)мин. - 110 K
2) средна - 153 K
 3) макс. - неизв. 
Луни -  63 луни регистрирани за сега , основните са галилеевите луни - Йо, Европа, Ганимед и Калисто. 







"
                    );
            }
        }
        public static PlanetInfo Io
        {
            get
            {
                return new PlanetInfo(
                    Resources.Io1,
                    Resources.Jupiter_,
                    "Йо",
@"Най-вътрешният от четирите Галилееви спътници на Юпитер и един от най-големите спътници в Слънчевата система с диаметър от около 3500 km. Открит e от Галилео Галилей през 1610 г. и е наречен на Йо, героиня от древногръцката митология, една от многобройните любовници на Зевс (Юпитер в римската митология).
",
 @" Характеристика : 
Орбитален период - 1 ден, 18 часа, 27,6 мин.
Диаметър - 7286,4 km  
Маса - 8,94×100 Zkg
Повърхностна температура
- мин. - 90 K
- средна - 130 K
- макс. - 2000 K








"
                    );
            }
        }
        public static PlanetInfo Europa
        {
            get
            {
                return new PlanetInfo(
                    Resources.Europa1,
                    Resources.Jupiter_,
                    "Европа",
@"Четвъртият по големина естествен спътник на Юпитер и най-малкия от четирите галилееви луни. Носи името на Европа, една от многото любовници на бога от древногръцката митология Зевс. Името е предложено от Симон Мариус скоро след откриването на спътника, но не навлиза в широка употреба до средата на 20 век. До този момент Европа е била изсвестна под името Юпитер 2 или вторият спътник на Юпитер.
",
 @" Характеристика : 
Орбитален период - 3 дни 13 часа 14,6 мин
Диаметър -  3243,2 km
Маса - 4,8×100 Zkg
Повърхностна температура
1) мин. - 85 K
2) средна - 103 K
3) макс. - 125 K 







"
                    );
            }
        }
        public static PlanetInfo Ganymede
        {
            get
            {
                return new PlanetInfo(
                    Resources.Ganymede1,
                    Resources.Jupiter_,
                    "Ганимед",
@"Ганимед е най-големия спътник в Слънчевата система, с радиус по-голям от този на Меркурий (но със значително по-малка маса) и от Плутон. Открит е на 11 януари 1609 г. от Галилео Галилей и носи името на най-красивия между смъртните — син на троянския цар Трос и нимфата Калироя от древногръцката митология. Името е предложено от Симон Мариус скоро след откриването му, но то не навлиза в широка употреба до началото на 20 век. Преди това Ганимед е наричан Юпитер 3 или третият спътник на Юпитер.
",
 @"Характеристика : 
Орбитален период - 7 дни 3 часа 42,6 мин.
Диаметър - 5524,8 km
Маса - 1,482×1 Ykg
Повърхностна температура
- мин. - неизв.
- средна - 113 K
- макс. - неизв.









"
                    );
            }
        }
        public static PlanetInfo Callisto
        {
            get
            {
                return new PlanetInfo(
                    Resources.Callisto1,
                    Resources.Jupiter_,
                    "Калисто",
@"Калисто е вторият по големина естествен спътник на Юпитер и третият в Слънчевата система. Открит е през 1610 г. от Галилео Галилей и носи името на любовницата на бога Зевс от древногръцката митология Калисто.
Името 'Калисто' е предложено от Симон Мариус скоро след откриването на спътника, но то не навлиза в широка употреба до средата на 20 век. Преди това Калисто е наричан Юпитер 4 или четвъртия спътник на Юпитер.

",
 @"Характеристика : 
Орбитален период -  16 дни 16 часа 32,2 мин
Диаметър - 9641,2 km
Маса - 1,076×1  Ykg
Повърхностна температура
- мин. - неизв.
- средна - неизв.
- макс. - неизв.










"
                    );
            }
        }
        public static PlanetInfo Saturn
        {
            get
            {
                return new PlanetInfo(
                    Resources.Saturn1,
                    Resources.Saturn_,
                    "Сатурн",
@"Сатурн е шестата планета от Слънчевата система. Тя е газов гигант и е втора по големина в Слънчевата система след Юпитер. Сатурн е известен най-вече с пръстените си съставени от лед и космически прах. Сатурн носи името на римския бог на посевите и на земеделието Сатурн, съответствие на бога Кронос в древногръцката митология . Символът на планетата е стилизирано изображение на сърп.

",
 @"Характеристика : 
Орбитален период -  10 757,73 дни
Диаметър - 120 536 km 
Маса -  5,6846×1 000 Ykg
Повърхностна температура
1) мин. - 82 K
2)средна - 143 K
3)макс. - неизв.
Луни : 60 известни до момента.











"
                    );
            }
        }
        public static PlanetInfo Dione
        {
            get
            {
                return new PlanetInfo(
                    Resources.Dione1,
                    Resources.Saturn_,
                    "Диона",
@"Естествен спътник на Сатурн. Открита е от Джовани Доменико Касини през 1684 г. Носи името на дъщерята на Уран и Гея от древногръцката митология Диона, но понякога бива наричана и Сатурн 4. Касини нарича четирите спътника на Сатурн, които открива, (Тетида, Диона, Рея и Япет), с колективното име Sidera Lodoicea или Звездите на Луи в чест на своя крал — френския Луи 14. Преди 1847 г. астрономите са наричали всички спътници Сатурн 1 до Сатурн 7, включвайки в поредицата и Титан, Мимас и Енцелад.

",
 @"Характеристика :
Орбитален период - 65 часа 41 мин. 05 сек.
Диаметър - 2236 km 
Маса - 1,096×10 Zkg
Повърхностна темепратура - 
– мин. - неизв.
– средна - 87 K
– макс. - неизв.












"
                    );
            }
        }
        public static PlanetInfo Enceladus
        {
            get
            {
                return new PlanetInfo(
                    Resources.Enceladus1,
                    Resources.Saturn_,
                    "Енцелад",
@"Естествен спътник на Сатурн открит през 1789 г. от английския астроном Уилям Хершел. Изследван е от апарата Касини-Хюйгенс през 2004 г. и 2005 г.Енцелад е наречен на името на един от гигантите от древногръцката митология Енцелад, затрупан от Зевс с вулкана Етна. Познат също като Сатурн 2.

",
 @"Характеристика : 
Орбитален период - 32 часа 53 мин 07 сек
Диаметър - 997,6 km
Маса -  8,6×100 Ekg
Повърхностна температура -
1)мин. - неизв.
2)средна - 70 K
3) макс. - неизв.













"
                    );
            }
        }
        public static PlanetInfo Phoebe
        {
            get
            {
                return new PlanetInfo(
                    Resources.Phoebe1,
                    Resources.Saturn_,
                    "Феба",
@"Феба е естествен спътник на Сатурн. Открит е от Уилям Хенри Пикеринг на 17 март 1899 г. от фотографски плаки заснети на 16 август 1899 г. в Арекипа, Перу от Делизъл Стюарт. Феба е първият спътник открит с помощта на фотографския метод.Спътника носи името на титанидата от древногръцката митология Феба. Като алтернативно име се употребява Сатурн 9.
",
 @"Характеристика : 
Орбитален период - 550,56 дни
Диаметър - 460×440×420 km
Маса - 7,2×1018 kg
Повърхностна температура - няма известни данни.














"
                    );
            }
        }
        public static PlanetInfo Hyperion
        {
            get
            {
                return new PlanetInfo(
                    Resources.Hyperion1,
                    Resources.Saturn_,
                    "Хиперион",
@"Хиперион е естествен спътник на Сатурн. Открит е през 1848 г. от Уилям Кранч Бонд, Джордж Филипс Бонд и Уилям Ласел и носи името на титана Хиперион от древногръцката митология. Като алтернатива се използва името Сатурн 7.Хиперион е най-голямото тяло с подчертано несферична форма в Слънчевата система.
",
 @"Характеристика :
Орбитален период - 21,280 дни
Диаметър - 532 km 
Маса - 1,08×100 Ekg
Повърхностна температура - няма известни данни.















"
                    );
            }
        }
        public static PlanetInfo Mimas
        {
            get
            {
                return new PlanetInfo(
                    Resources.Mimas1,
                    Resources.Saturn_,
                    "Мимас",
@"Естествен спътник на Сатурн открит през 1789 г. от Уилям Хершел.По диаметър Мимас е 20-тия най-голям спътник в Слънчевата система.Спътникът носи името на един от сто и петдесетте гиганти със змеевидна опашка от древногръцката митология Мимас, син на Уран и на Гея. Като алтернатива се използва означението Сатурн 1.
",
 @"Характеристика : 
Орбитален период -  22 часа 37 мин. 5 сек.
Диаметър -  794,4 km
Маса - 3,84×100 Ekg 
Повърхностна температура - няма известни данни.
















"
                    );
            }
        }
        public static PlanetInfo Iapetus
        {
            get
            {
                return new PlanetInfo(
                    Resources.Iapetus1,
                    Resources.Saturn_,
                    "Япет",
@"Япет е третият по големина естествен спътник на Сатурн. Открит е от Джовани Доменико Касини на 25 октомври 1671 г. и е известен с коренно различното си албедо на водещото (спрямо орбиталното движение на спътника) и задното си полукълбо. Апаратът Касини-Хюйгенс разкрива допълнителни особености на Япет. Носи името на един от титаните от древногръцката митология Япет. Понякога бива наричан Сатурн 8.
",
 @"Характеристика : 
Орбитален период - 79 дни 7 часа 55 мин
Диаметър - 2872 km
Маса - 1,9739×10 Zkg
Повърхностна температура - няма известни данни.
















"
                    );
            }
        }
        public static PlanetInfo Rhea
        {
            get
            {
                return new PlanetInfo(
                    Resources.Rhea1,
                    Resources.Saturn_,
                    "Рея",
@"Рея е вторият по големина естествен спътник на Сатурн след Титан. Открит е през 1672 г. от Джовани Доменико Касини и носи името на Рея — жена на Кронос и майка на Зевс в древногръцката митология. Понякога за спътника се употребява името Сатурн 4.Касини нарича четирите спътника на Сатурн, които открива (Тетида, Диона, Рея и Япет), с колективното име Sidera Lodoicea или Звездите на Луи в чест на своя крал — френския крал Луи 14. Преди 1847 г. астрономите са наричали всички спътници Сатурн 1 до Сатурн 7.
",
 @"Характеристика :
Орбитален период -  4 дни 108 часа 25 мин. 12 сек.
Диаметър -  3056 km 
Маса - 2,3166×10 Zkg
Повърхностна температура - 
– мин. - 54 K
– средна - неизв.
– макс.  - 99 K
















"
                    );
            }
        }
        public static PlanetInfo Tethys
        {
            get
            {
                return new PlanetInfo(
                    Resources.Tethys1,
                    Resources.Saturn_,
                    "Тетида",
@"Естествен спътник на Сатурн, открит от Джовани Доменико Касини през 1684 г.Касини нарича четирите спътника на Сатурн, които открива, (Тетида, Диона, Рея и Япет), с колективното име Sidera Lodoicea или Звездите на Луи в чест на своя крал - френския Луи 14. Преди 1847 г. астрономите са наричали всички спътници Сатурн 1 до Сатурн 7, включвайки в поредицата и Титан, Мимас и Енцелад.
",
 @"Характеристика : 
Орбитален период -  45 часа 18 мин. 26 сек.
Диаметър - 2119.6 km
Маса - 6,176×1 Zkg
Повърхностна температура - 
– мин. - неизв.
– средна - 86 K
– макс. - неизв.

"
                    );
            }
        }
        public static PlanetInfo Titan
        {
            get
            {
                return new PlanetInfo(
                    Resources.Titan1,
                    Resources.Saturn_,
                    "Титан",
@"Най-големият спътник на Сатурн и втори по големина в Слънчевата система след Юпитеровия Ганимед. Планетата Меркурий е по-малка от Титан.Титан е открит на 25 март 1655 г. от холандеца Кристиян Хюйгенс. Наречен е на титаните — великани от гръцката митология, сестри и братя на Кронос (гръцкият Сатурн). Това име, както и названията на още 7 сатурнови спътника е предложено за пръв път от сина на откривателя на Уран Уилям Хершел — Джон Хершел.
",
 @"Характеристика :
Орбитален период - 15 дни 22 часа 41 мин
Диаметър - 10 300 km
Маса - 1,345×1 Ykg
Повърхностна температура - 
– мин. - неизв.
– средна - 94 K
– макс.  - неизв.

"
                    );
            }
        }
        public static PlanetInfo Uranus
        {
            get
            {
                return new PlanetInfo(
                    Resources.Uranus1,
                    Resources.Uranus_,
                    "Уран",
@"Уран е седмата планета от Слънчевата система. Тя е газов гигант и е трета по размери и четвърта по маса в Слънчевата система. Уран носи името на бога на небето от древногръцката митология Уран. Въпреки, че е вѝдима с невъоръжено око подобно на петте класически планети, Уран не е наблюдавана от древните астрономи заради межделивостта около планетата.
",
 @"Характеристика : 
Орбитален период - 30 708,1600 дни
Диаметър - 51 118 km
Маса - 8,6832×100 Ykg
Повърхностна температура - 
- мин. - 59 K
- средна - 68 K
- макс. - неизв. 
Луни : има 27 известни естествени спътници най-големите от които са Миранда, Ариел, Умбриел, Титания и Оберон.


"
                    );
            }
        }
        public static PlanetInfo Umbriel
        {
            get
            {
                return new PlanetInfo(
                    Resources.Umbriel1,
                    Resources.Uranus_,
                    "Умбриел",
@"Умбриел е естествен спътник на Уран. Открит от английския астроном Уилям Ласел на 24 октомври 1851 г. едновременно със спътника Ариел. Единствения апарат изследвал Умбриел досега е Вояджър 2 по време на прехода си през урановата система през януари 1986 г. Изследвана е само осветеното от Слънцето южно полукълбо.
",
 @"Характеристика :
Орбитален период - 4,14 дни
Диаметър - 2338.4 km
Маса  - 1,2×10 Zkg
Повърхностна температура ~ 85 K



"
                    );
            }
        }
        public static PlanetInfo Titania
        {
            get
            {
                return new PlanetInfo(
                    Resources.Titania1,
                    Resources.Uranus_,
                    "Титания",
@"Титания е най-големия естествен спътник на Уран. Открит е на 11 януари 1787 г. от Уилям Хершел.Титания е открита на 11 януари 1787 г. от Уилям Хершел. В същата година е открит и друг спътник на Уран — Оберон. Хершел по-късно съобщава за откриването на още четири спътника, но тази информация се оказва невярна.
",
 @"Характеристика :
Орбитален период - 8,71 дни
Диаметър - 3155.6 km
Маса - 3,526×10 Zkg
Повърхностна температура - няма известни данни.




"
                    );
            }
        }
        public static PlanetInfo Oberon
        {
            get
            {
                return new PlanetInfo(
                    Resources.Oberon1,
                    Resources.Uranus_,
                    "Оберон",
@"Оберон е най-външният от големите спътници на Уран. Открит е на 11 януари 1787 г. от Уилям Хершел. Понякога спътника е обозначаван и като Уран IV. Той е втори по големина и маса Уранов спътник и деветия най-масивен в Слънчевата система. Оберон се намира извън магнитосферата на планетата.Спътникът е съставен от равни количества скали и лед и най-вероятно има каменно ядро, обвито от ледена мантия. Възможно е наличие на воден слой на границата между мантията и ядрото.
",
 @"Характеристика : 
Орбитален период - 13,463234 дни
Диаметър - 3045,6 km
Маса - 3,014×10 Zkg
Повърхностна температура  - няма известни данни.





"
                    );
            }
        }
        public static PlanetInfo Miranda
        {
            get
            {
                return new PlanetInfo(
                    Resources.Miranda1,
                    Resources.Uranus_,
                    "Миранда",
@"Миранда е петият по-големина естествен спътник на Уран. Открит е през 1948 г. от холандско-американския астроном Герард Кайпер в обсерваторията във Форт Дейвис. Носи името на дъщерята на Просперо от пиесата на Уилям Шекспир Бурята. Като алтернатива се употребява означението Уран 5.
",
 @"Характеристика :
Орбитален период - 1 ден 9 часа 55 мин. 25 сек.
Диаметър - 943.2 km 
Маса - 6,59×1 Ekg
Повърхностна температура - 86 K






"
                    );
            }
        }
        public static PlanetInfo Ariel
        {
            get
            {
                return new PlanetInfo(
                    Resources.Ariel1,
                    Resources.Uranus_,
                    "Ариел",
@"Ариел е естествен спътник на Уран. Открит от английския астроном Уилям Ласел на 24 октомври 1851 г едновременно със спътника Умбриел. Спътникът носи името на героиня от произведението на Александър Поуп „Влизане с взлом“. Името Ариел както и имената на четири други естествени спътника на Уран са предложени от сина на Уилям Хершел — Джон Хершел.
",
 @"Характеристика : 
Орбитален период - 2,52 дни
Диаметър - неизвестен.
Маса - 1,35×10 Zkg
Повърхностна температура ~ 80 K






"
                    );
            }
        }
        public static PlanetInfo Neptune
        {
            get
            {
                return new PlanetInfo(
                    Resources.Neptune1,
                    Resources.Neptune_,
                    "Нептун",
@"Нептун е осмата планета от Слънчевата система и най-външния газов гигант в нея. Тя е четвъртата по размери и третата по маса. Нептун е най-отдалечената от Слънцето планета. Нептун носи името на римския бог на морето Нептун. Символът на планетата е стилизирано изображение на тризъбеца на Нептун. Първата планета, чието съществуване е доказано чрез математически изчисления, а не от емпирични наблюдения.
",
 @"Характеристика :
Орбитален период - 60 224,9036 дни
Диаметър - 49 528 km
Маса - 1,0243×1 000 Ykg
Повърхностна температура -
- мин. - 50 K
- средна - 53 K
- макс. - неизв.
Луни : Нептун има 13 известни естествени спътници.







"
                    );
            }
        }
        public static PlanetInfo Triton
        {
            get
            {
                return new PlanetInfo(
                    Resources.Triton1,
                    Resources.Neptune_,
                    "Тритон",
@"Тритон е най-големият естествен спътник на Нептун. Открит е на 10 октомври 1846 г. от английският астроном Уилям Ласел, само 17 дни след откриването на Нептун. Тритон понякога бива наричан Нептун 1.Спътникът носи името на сина на бога на морето Посейдон от древногръцката митология Тритон.
",
 @"Характеристика : 
Орбитален период -  5,877 дни
Диаметър - 5413.6 km
Маса - 2,147×1 Ykg
Повърхностна температура -
– мин. - неизв.
– средна - 34,5 K







"
                    );
            }
        }
        public static PlanetInfo Proteus
        {
            get
            {
                return new PlanetInfo(
                    Resources.Proteus1,
                    Resources.Neptune_,
                    "Протей",
@"Протей е естествен спътник на Нептун, носещ името на морското божество от древногръцката митология Протей, син на Посейдон. За откриватели се посочват Харолд Ретсема, Уилям Хубарт, Лари Лебовски и Дейвид Толен, които на 24 май 1981 г. откриват спътника използвайки окултация, но наблюденията им са недостатъчни, за да бъде определена орбитата му.
",
 @"Характеристика : 
Орбитален период - 1,122 дни
Диаметър - 840 km
Маса - 5×100  Ekg 
Повърхностна температура ~ 70 K






"
                    );
            }
        }
        public static PlanetInfo Nereid
        {
            get
            {
                return new PlanetInfo(
                    Resources.Nereid1,
                    Resources.Neptune_,
                    "Нереида",
@"Нереида е естествен спътник на Нептун, открит на 1 май 1949 г. от астронома Герард Кайпер. Спътникът носи името на нимфата от древногръцката митология Нереида. Като алтернатива се използва името Нептун 2. Нереида е третият по големина спътник на Нептун.
",
 @"Характеристика : 
Орбитален период - 360,1362 дни
Диаметър - 680 km 
Маса - 3,1×100 Ekg
Повърхностна температура - няма известни данни.







"
                    );
            }
        }
    }
}
